package beauty.serven;

/**
 * 功能描述：算法——数独游戏_深度优先搜索
 * <p>
 * 玩家需要根据9×9盘面上的已知数字，推理出所有剩余空格的数字，并满足每一行、每一列、每一个同色九宫内的数字均含1-9，不重复。
 * 数独的答案都是唯一的，所以，多个解也称为无解。
 * <p>
 * 本图的数字据说是芬兰数学家花了3个月的时间设计出来的较难的题目。但对会使用计算机编程的你来说，恐怕易如反掌了。
 * <p>
 * 本题的要求就是输入数独题目，程序输出数独的唯一解。我们保证所有已知数据的格式都是合法的，并且题目有唯一的解。
 * <p>
 * 格式要求：
 * 输入9行，每行9个数字，0代表未知，其它数字为已知。
 * 输出9行，每行9个数字表示数独的解。
 * <p>
 * 例如：
 * 输入（即图中题目）：
 * 005300000
 * 800000020
 * 070010500
 * 400005300
 * 010070006
 * 003200080
 * 060500009
 * 004000030
 * 000009700
 * <p>
 * 程序应该输出：
 * 145327698
 * 839654127
 * 672918543
 * 496185372
 * 218473956
 * 753296481
 * 367542819
 * 984761235
 * 521839764
 * <p>
 * 再例如，输入：
 * 800000000
 * 003600000
 * 070090200
 * 050007000
 * 000045700
 * 000100030
 * 001000068
 * 008500010
 * 090000400
 * <p>
 * 程序应该输出：
 * 812753649
 * 943682175
 * 675491283
 * 154237896
 * 369845721
 * 287169534
 * 521974368
 * 438526917
 * 796318452
 *
 * @author RenShiWei
 * Date: 2020/5/6 15:59
 **/
public class 数独游戏_深度优先搜索 {



}

